In [1]:
import pandas as pd

In [11]:
df = pd.read_csv("data.csv")
df

,Name,Age,Department,Position,Years_Experience,Salary,Performance_Rating,Projects_Completed,Hours_Worked_Per_Week,Education,Location,Skills
0,Shrii,28,Engineering,Senior Developer,5,95000,4.5,23,42,Masters,Bangalore,Python|JavaScript|React
1,Samay,32,Marketing,Marketing Manager,7,88000,4.2,18,38,Bachelors,Mumbai,SEO|Analytics|Content
2,Bhargav,26,Engineering,Junior Developer,2,65000,4.0,12,40,Bachelors,Pune,Java|SQL|Spring
3,Adarsh,35,Finance,Financial Analyst,10,105000,4.8,31,45,MBA,Delhi,Excel|SAP|Forecasting
4,Prabh,29,Design,Lead Designer,6,82000,4.6,27,39,Bachelors,Hyderabad,Figma|Adobe|UI/UX
5,MoneyBhai,41,Finance,CFO,15,185000,4.9,45,50,MBA,Mumbai,Strategy|Finance|Leadership
6,Krish,24,Engineering,Intern,1,45000,3.8,8,35,Bachelors,Bangalore,Python|HTML|CSS

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Name                   7 non-null      object
 1   Age                    7 non-null      int64
 2   Department             7 non-null      object
 3   Position               7 non-null      object
 4   Years_Experience       7 non-null      int64
 5   Salary                 7 non-null      int64
 6   Performance_Rating     7 non-null      float64
 7   Projects_Completed     7 non-null      int64
 8   Hours_Worked_Per_Week  7 non-null      int64
 9   Education              7 non-null      object
 10  Location               7 non-null      object
 11  Skills                 7 non-null      object
dtypes: float64(1), int64(5), object(6)
memory usage: 804.0+ bytes

In [10]:
df.loc[1]

Name                                     Samay
Age                                         32
Department                           Marketing
Position                     Marketing Manager
Years_Experience                             7
Salary                                   88000
Performance_Rating                         4.2
Projects_Completed                          18
Hours_Worked_Per_Week                       38
Education                            Bachelors
Location                                Mumbai
Skills                   SEO|Analytics|Content
Name: 1, dtype: object

In [13]:
df.iloc[1]

Name                                     Samay
Age                                         32
Department                           Marketing
Position                     Marketing Manager
Years_Experience                             7
Salary                                   88000
Performance_Rating                         4.2
Projects_Completed                          18
Hours_Worked_Per_Week                       38
Education                            Bachelors
Location                                Mumbai
Skills                   SEO|Analytics|Content
Name: 1, dtype: object

In [15]:
df.loc[3,"Education"]

'MBA'

In [16]:
df.iloc[3,9]

'MBA'

In [20]:
# For .loc[0:2] 0,1,2 will be output
df.loc[0:2, ["Name", "Education"]]

      Name  Education
0    Shrii    Masters
1    Samay  Bachelors
2  Bhargav  Bachelors

In [21]:
# For .iloc[0:2] 0,1 will be output
df.iloc[0:2, 0:3]

    Name  Age   Department
0  Shrii   28  Engineering
1  Samay   32    Marketing